# Lab Session

## <font color='blue'> Table Of Contents </font>
- Problem Statement
- Load required libraries
- Connect to DB using mysql-connector-python package
- Create database named `e_commerce`
- Create tables and insert data into tables as specified in the question
- Read all the questions and write sql queries to meet the objective

## <font color='blue'> Problem Statement </font>
###  An E-commerce website manages its data in the form of various tables.
You need to create a Database called `e_commerce` and various tables in it. The tables needed and attributes which need to be in every table are given before hand. All you have to do is create tables with data in it and answer some of the questions that follows.

### Load Required Libraries

In [39]:
pip install ipython

Requirement already satisfied: ipython in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (8.26.0)
Requirement already satisfied: decorator in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from ipython) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from ipython) (0.19.1)
Requirement already satisfied: matplotlib-inline in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from ipython) (0.1.7)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from ipython) (3.0.47)
Requirement already satisfied: pygments>=2.4.0 in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from ipython) (2.18.0)
Requirement already satisfied: stack-data in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from ipython) (0.6.3)
Requirement already satisfied: traitlets>=5.13.0 in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from ipython) (5.14.3)
Requirement already satisfied: colorama in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from ipython) (0.4.6)
Requirement already satisfied: parso<0.9.0,>=0.8.3 in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from jedi>=0.16->ipython) (0.8.4)
Requirement already satisfied: wcwidth in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from prompt-toolkit<3.1.0,>=3.0.41->ipython) (0.2.13)
Requirement already satisfied: executing>=1.2.0 in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from stack-data->ipython) (2.0.1)
Requirement already satisfied: asttokens>=2.1.0 in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from stack-data->ipython) (2.4.1)
Requirement already satisfied: pure-eval in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from stack-data->ipython) (0.2.2)
Requirement already satisfied: six>=1.12.0 in c:\users\vikyd\appdata\local\programs\python\python312\lib\site-packages (from asttokens>=2.1.0->stack-data->ipython) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [40]:
import mysql.connector
from mysql.connector import Error
import pandas as pd
from IPython.display import display

### Connect to DB using Mysql-connector-python package

In [2]:
try:
    connection = mysql.connector.connect(
        host='localhost',
        user='root',
        password='root'
    )
    if connection.is_connected():
        print("Connected to MySQL Server")
except Error as e:
    print("Error while connecting to MySQL", e)

cursor = connection.cursor()

Connected to MySQL Server

### You are required to create a database named 'e_commerce'

In [68]:
cursor.execute("CREATE DATABASE IF NOT EXISTS e_commerce")
cursor.execute("USE e_commerce")

### Q1. Create tables for supplier, customer, category, product, productDetails, order, rating to store the data for the E-commerce with the schema definition given below.


- **`supplier`**(SUPP_ID int primary key, SUPP_NAME varchar(50), SUPP_CITY varchar(50), SUPP_PHONE varchar(10))


- **`customer`** (CUS_ID INT NOT NULL, CUS_NAME VARCHAR(20) NULL DEFAULT NULL, CUS_PHONE VARCHAR(10), CUS_CITY varchar(30) ,CUS_GENDER CHAR,PRIMARY KEY (CUS_ID))


- **`category`** (CAT_ID INT NOT NULL, CAT_NAME VARCHAR(20) NULL DEFAULT NULL,PRIMARY KEY (CAT_ID))


- **`product`** (PRO_ID INT NOT NULL, PRO_NAME VARCHAR(20) NULL DEFAULT NULL, PRO_DESC VARCHAR(60) NULL DEFAULT NULL, CAT_ID INT NOT NULL,PRIMARY KEY (PRO_ID),FOREIGN KEY (CAT_ID) REFERENCES CATEGORY (CAT_ID))


- **`product_details`** (PROD_ID INT NOT NULL, PRO_ID INT NOT NULL, SUPP_ID INT NOT NULL, PROD_PRICE INT NOT NULL,
  PRIMARY KEY (PROD_ID),FOREIGN KEY (PRO_ID) REFERENCES PRODUCT (PRO_ID), FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER(SUPP_ID))
  
  
- **`order`** (ORD_ID INT NOT NULL, ORD_AMOUNT INT NOT NULL, ORD_DATE DATE, CUS_ID INT NOT NULL, PROD_ID INT NOT NULL,PRIMARY KEY (ORD_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID),FOREIGN KEY (PROD_ID) REFERENCES PRODUCT_DETAILS(PROD_ID))


- **`rating`** (RAT_ID INT NOT NULL, CUS_ID INT NOT NULL, SUPP_ID INT NOT NULL, RAT_RATSTARS INT NOT NULL,PRIMARY KEY (RAT_ID),FOREIGN KEY (SUPP_ID) REFERENCES SUPPLIER (SUPP_ID),FOREIGN KEY (CUS_ID) REFERENCES CUSTOMER(CUS_ID))

In [69]:
cursor.execute("""
CREATE TABLE IF NOT EXISTS supplier (
    SUPP_ID INT PRIMARY KEY,
    SUPP_NAME VARCHAR(50),
    SUPP_CITY VARCHAR(50),
    SUPP_PHONE VARCHAR(10)
)
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS customer (
    CUS_ID INT PRIMARY KEY,
    CUS_NAME VARCHAR(20),
    CUS_PHONE VARCHAR(10),
    CUS_CITY VARCHAR(30),
    CUS_GENDER CHAR(1)
)
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS category (
    CAT_ID INT PRIMARY KEY,
    CAT_NAME VARCHAR(20)
)
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS product (
    PRO_ID INT PRIMARY KEY,
    PRO_NAME VARCHAR(20),
    PRO_DESC VARCHAR(60),
    CAT_ID INT,
    FOREIGN KEY (CAT_ID) REFERENCES category(CAT_ID)
)
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS product_details (
    PROD_ID INT PRIMARY KEY,
    PRO_ID INT,
    SUPP_ID INT,
    PROD_PRICE INT,
    FOREIGN KEY (PRO_ID) REFERENCES product(PRO_ID),
    FOREIGN KEY (SUPP_ID) REFERENCES supplier(SUPP_ID)
)
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS orders (
    ORD_ID INT PRIMARY KEY,
    ORD_AMOUNT INT,
    ORD_DATE DATE,
    CUS_ID INT,
    PROD_ID INT,
    FOREIGN KEY (CUS_ID) REFERENCES customer(CUS_ID),
    FOREIGN KEY (PROD_ID) REFERENCES product_details(PROD_ID)
)
""")

cursor.execute("""
CREATE TABLE IF NOT EXISTS rating (
    RAT_ID INT PRIMARY KEY,
    CUS_ID INT,
    SUPP_ID INT,
    RAT_RATSTARS INT,
    FOREIGN KEY (SUPP_ID) REFERENCES supplier(SUPP_ID),
    FOREIGN KEY (CUS_ID) REFERENCES customer(CUS_ID)
)
""")

connection.commit()

### Q2. Insert the following data in the table created above
#### `Note:` If you are getting any error while inserting the data into tables, Kindly close the connection and reconnect

#### Table:  supplier
| SUPP_ID | SUPP_NAME | SUPP_CITY | SUPP_PHONE |
| --- | --- | --- | --- |
| 1 | Rajesh Retails | Delhi | 1234567890 |
| 2 | Appario Ltd. | Mumbai | 258963147032 |
| 3 | Knome products | Bangalore | 9785462315 |
| 4 | Bansal Retails | Kochi | 8975463285 |
| 5 | Mittal Ltd. | Lucknow | 7898456532 |

In [ ]:
# insert into "supplier" table
cursor.execute("""
INSERT INTO supplier (SUPP_ID, SUPP_NAME, SUPP_CITY, SUPP_PHONE) VALUES
(1, 'Rajesh Retails', 'Delhi', '1234567890'),
(2, 'Appario Ltd.', 'Mumbai', '2589631470'),
(3, 'Knome products', 'Bangalore', '9785462315'),
(4, 'Bansal Retails', 'Kochi', '8975463285'),
(5, 'Mittal Ltd.', 'Lucknow', '7898456532')
""")

#### Table:  customer
| CUS_ID | CUS_NAME | SUPP_PHONE | CUS_CITY | CUS_GENDER
| --- | --- | --- | --- | --- |
| 1 | AAKASH | 9999999999 | DELHI | M |
| 2 | AMAN | 9785463215 | NOIDA | M |
| 3 | NEHA | 9999999998 | MUMBAI | F |
| 4 | MEGHA | 9994562399 | KOLKATA | F |
| 5 | PULKIT | 7895999999 | LUCKNOW | M |

In [ ]:
# insert into "customer" table
cursor.execute("""
INSERT INTO customer (CUS_ID, CUS_NAME, CUS_PHONE, CUS_CITY, CUS_GENDER) VALUES
(1, 'AAKASH', '9999999999', 'DELHI', 'M'),
(2, 'AMAN', '9785463215', 'NOIDA', 'M'),
(3, 'NEHA', '9999999998', 'MUMBAI', 'F'),
(4, 'MEGHA', '9994562399', 'KOLKATA', 'F'),
(5, 'PULKIT', '7895999999', 'LUCKNOW', 'M')
""")

#### Table:  category
| CAT_ID | CAT_NAME |
| --- | --- |  
| 1 | BOOKS |
| 2 | GAMES |  
| 3 | GROCERIES |
| 4 | ELECTRONICS |
| 5 | CLOTHES |

In [ ]:
# insert into "categoty" table
cursor.execute("""
INSERT INTO category (CAT_ID, CAT_NAME) VALUES
(1, 'BOOKS'),
(2, 'GAMES'),
(3, 'GROCERIES'),
(4, 'ELECTRONICS'),
(5, 'CLOTHES')
""")

#### Table:  product
| PRO_ID | PRO_NAME | PRO_DESC | CAT_ID |
| --- | --- | --- | --- |
| 1 | GTA V | DFJDJFDJFDJFDJFJF | 2 |
| 2 | TSHIRT | DFDFJDFJDKFD | 5 |
| 3 | ROG LAPTOP | DFNTTNTNTERND | 4 |
| 4 | OATS | REURENTBTOTH | 3 |
| 5 | HARRY POTTER | NBEMCTHTJTH | 1 |

In [ ]:
# insert into "product" table
cursor.execute("""
INSERT INTO product (PRO_ID, PRO_NAME, PRO_DESC, CAT_ID) VALUES
(1, 'GTA V', 'DFJDJFDJFDJFDJFJF', 2),
(2, 'TSHIRT', 'DFDFJDFJDKFD', 5),
(3, 'ROG LAPTOP', 'DFNTTNTNTERND', 4),
(4, 'OATS', 'REURENTBTOTH', 3),
(5, 'HARRY POTTER', 'NBEMCTHTJTH', 1)
""")

#### Table:  product_details
| PROD_ID | PRO_ID | SUPP_ID | PROD_PRICE |
| --- | --- | --- | --- |
| 1 | 1 | 2 | 1500 |
| 2 | 3 | 5 | 30000 |
| 3 | 5 | 1 | 3000 |
| 4 | 2 | 3 | 2500 |
| 5 | 4 | 1 | 1000 |

In [ ]:
# insert into "product_details" table
cursor.execute("""
INSERT INTO product_details (PROD_ID, PRO_ID, SUPP_ID, PROD_PRICE) VALUES
(1, 1, 2, 1500),
(2, 3, 5, 30000),
(3, 5, 1, 3000),
(4, 2, 3, 2500),
(5, 4, 1, 1000)
""")

#### Table:  orders
| ORD_ID | ORD_AMOUNT | ORD_DATE | CUS_ID | PROD_ID
| --- | --- | --- | --- | --- |
| 20 | 1500 | 2021-10-12 | 3 | 5 |
| 25 | 30500 | 2021-09-16 | 5 | 2 |
| 26 | 2000 | 2021-10-05 | 1 | 1 |
| 30 | 3500 | 2021-08-16 | 4 | 3 |
| 50 | 2000 | 2021-10-06 | 2 | 1 |

In [ ]:
# insert into "orders" table
cursor.execute("""
INSERT INTO orders (ORD_ID, ORD_AMOUNT, ORD_DATE, CUS_ID, PROD_ID) VALUES
(20, 1500, '2021-10-12', 3, 5),
(25, 30500, '2021-09-16', 5, 2),
(26, 2000, '2021-10-05', 1, 1),
(30, 3500, '2021-08-16', 4, 3),
(50, 2000, '2021-10-06', 2, 1)
""")

#### Table: rating
| RAT_ID | CUS_ID | SUPP_ID | RAT_RATSTARS |
| --- | --- | --- | --- |
| 1 | 2 | 2 | 4 |
| 2 | 3 | 4 | 3 |
| 3 | 5 | 1 | 5 |
| 4 | 1 | 3 | 2 |
| 5 | 4 | 5 | 4 |

In [ ]:
# insert into "rating" table
cursor.execute("""
INSERT INTO rating (RAT_ID, CUS_ID, SUPP_ID, RAT_RATSTARS) VALUES
(1, 2, 2, 4),
(2, 3, 4, 3),
(3, 5, 1, 5),
(4, 1, 3, 2),
(5, 4, 5, 4)
""")

### Q3) Display the number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000.

In [77]:
cursor.execute("""
SELECT c.CUS_GENDER, COUNT(DISTINCT c.CUS_ID) as customer_count
FROM customer c
JOIN orders o ON c.CUS_ID = o.CUS_ID
WHERE o.ORD_AMOUNT >= 3000
GROUP BY c.CUS_GENDER
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=['Gender', 'Count'])
print("\n Number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000: \n")
display(df)

 Number of the customer group by their genders who have placed any order of amount greater than or equal to Rs.3000:

  Gender  Count
0      F      1
1      M      1

### Q4) Display all the order along with product name ordered by a customer having Customer_Id=2;

In [78]:
cursor.execute("""
SELECT o.ORD_ID, p.PRO_NAME, o.ORD_AMOUNT, o.ORD_DATE
FROM orders o
JOIN product_details pd ON o.PROD_ID = pd.PROD_ID
JOIN product p ON pd.PRO_ID = p.PRO_ID
WHERE o.CUS_ID = 2
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=['Order ID', 'Product', 'Amount', 'Date'])
print("\n All the order along with product name ordered by a customer having Customer_Id=2: \n")
display(df)

 All the order along with product name ordered by a customer having Customer_Id=2:

   Order ID Product  Amount        Date
0        50   GTA V    2000  2021-10-06

### Q5) Display the Supplier details who can supply more than one product.

In [79]:
cursor.execute("""
SELECT s.SUPP_ID, s.SUPP_NAME, s.SUPP_CITY, s.SUPP_PHONE
FROM supplier s
JOIN product_details pd ON s.SUPP_ID = pd.SUPP_ID
GROUP BY s.SUPP_ID
HAVING COUNT(DISTINCT pd.PRO_ID) > 1
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=['Supplier ID', 'Name', 'City', 'Phone'])
print("\n The Supplier details who can supply more than one product: \n")
display(df)

 The Supplier details who can supply more than one product:

   Supplier ID            Name   City       Phone
0            1  Rajesh Retails  Delhi  1234567890

### Q6) Find the category of the product whose order amount is minimum.

In [80]:
cursor.execute("""
SELECT c.CAT_ID, c.CAT_NAME
FROM category c
JOIN product p ON c.CAT_ID = p.CAT_ID
JOIN product_details pd ON p.PRO_ID = pd.PRO_ID
JOIN orders o ON pd.PROD_ID = o.PROD_ID
WHERE o.ORD_AMOUNT = (SELECT MIN(ORD_AMOUNT) FROM orders)
LIMIT 1
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=['Category ID', 'Category Name'])
print("\n Category of the product whose order amount is minimum: \n")
display(df)

 Category of the product whose order amount is minimum:

   Category ID Category Name
0            3     GROCERIES

### Q7) Display the Id and Name of the Product ordered after “2021-10-05”.

In [81]:
cursor.execute("""
SELECT DISTINCT p.PRO_ID, p.PRO_NAME
FROM product p
JOIN product_details pd ON p.PRO_ID = pd.PRO_ID
JOIN orders o ON pd.PROD_ID = o.PROD_ID
WHERE o.ORD_DATE > '2021-10-05'
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=['Product ID', 'Product Name'])
print("\n Id and Name of the Product ordered after “2021-10-05”: \n")
display(df)

 Id and Name of the Product ordered after “2021-10-05”:

   Product ID Product Name
0           4         OATS
1           1        GTA V

### Q8) Print the top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating.

In [82]:
cursor.execute("""
SELECT s.SUPP_ID, s.SUPP_NAME, r.RAT_RATSTARS, c.CUS_NAME
FROM supplier s
JOIN rating r ON s.SUPP_ID = r.SUPP_ID
JOIN customer c ON r.CUS_ID = c.CUS_ID
ORDER BY r.RAT_RATSTARS DESC
LIMIT 3
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=['Supplier ID', 'Name', 'Rating', 'Customer'])
print("\n Top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating: \n")
display(df)

 Top 3 supplier name and id and rating on the basis of their rating along with the customer name who has given the rating:

   Supplier ID            Name  Rating Customer
0            1  Rajesh Retails       5   PULKIT
1            2    Appario Ltd.       4     AMAN
2            5     Mittal Ltd.       4    MEGHA

### Q9) Display customer name and gender whose names start or end with character 'A'.

In [87]:
cursor.execute("""
SELECT CUS_NAME, CUS_GENDER
FROM customer
WHERE CUS_NAME LIKE 'A%' OR CUS_NAME LIKE '%A'
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=['Customer Name', 'Gender'])
print("\n Customer name and gender whose names start or end with character 'A': \n")
display(df)

 Customer name and gender whose names start or end with character 'A':

  Customer Name Gender
0        AAKASH      M
1          AMAN      M
2          NEHA      F
3         MEGHA      F

### Q10) Display the total order amount of the male customers.

In [84]:
cursor.execute("""
SELECT SUM(o.ORD_AMOUNT) as total_amount
FROM orders o
JOIN customer c ON o.CUS_ID = c.CUS_ID
WHERE c.CUS_GENDER = 'M'
""")
result = cursor.fetchone()
df = pd.DataFrame([result], columns=['Total Order Amount (Male Customers)'])
print("\n Total order amount of the male customers: \n")
display(df)

 Total order amount of the male customers:

  Total Order Amount (Male Customers)
0                               34500

### Q11) Display all the Customers left outer join with  the orders

In [86]:
cursor.execute("""
SELECT c.CUS_ID, c.CUS_NAME, o.ORD_ID, o.ORD_AMOUNT, o.ORD_DATE
FROM customer c
LEFT OUTER JOIN orders o ON c.CUS_ID = o.CUS_ID
""")
result = cursor.fetchall()
df = pd.DataFrame(result, columns=['Customer ID', 'Name', 'Order ID', 'Order Amount', 'Order Date'])
print("\n All the Customers left outer join with the orders: \n")
display(df)

 All the Customers left outer join with the orders:

   Customer ID    Name  Order ID  Order Amount  Order Date
0            1  AAKASH        26          2000  2021-10-05
1            2    AMAN        50          2000  2021-10-06
2            3    NEHA        20          1500  2021-10-12
3            4   MEGHA        30          3500  2021-08-16
4            5  PULKIT        25         30500  2021-09-16

**NOTE:** Always close an open connection once you are done with the database operations

In [ ]:
# Close the connection
connection.close()

## Happy Learning:)